// Операции с массивами
'use strict';

// 1 Создайте массив styles с элементами «Джаз» и «Блюз».
const styles = ['Джаз', 'Блюз'];
// 2 Добавьте «Рок-н-ролл» в конец.
styles.push();
// 3 Замените значение в середине на «Классика». Ваш код для поиска значения в середине должен работать для массивов с любой длиной.
styles[Math.floor((styles.length - 1) / 2)] = 'Классика';
// 4 Удалите первый элемент массива и покажите его.
alert( styles.shift() );
// 5 Вставьте «Рэп» и «Регги» в начало массива.
styles.unshift('Рэп', 'Регги');