// Вопрос о "if"

if (-1 || 0) alert( 'first' );              // т.к оператор || вернет -1, то мы пройдем в условие и выполнится alert
if (-1 && 0) alert( 'second' );             // т.к оператор && вернет 0, то условие не будет пройдено
if (null || -1 && 1) alert( 'third' );      // сначала оператор && вернет 1, затем оператор || вернет 1 и
                                            // условие будет пройдено => alert выполнится
                                            // выполнится ПЕРВЫЙ и ПОСЛЕДНИЙ alert