// Побитовый оператор и значение
// почему значения не изменяются
console.log(123 ^ 0); // в данном выражении значение не меняется потому что исключающее или меняет знак только при
                      // одинаковых битах двух чисел равных 1
console.log(0 ^ 123); // в данном выражении значение не меняется потому что исключающее или меняет знак только при
                      // одинаковых битах двух чисел равных 1
console.log(~~123); // побитовое не меняет знаки на противоположные два раза, поэтому результат остается таким же
